{
  "backend/main.mo": "Main Motoko actor for TamriStream backend with comprehensive state management for 75+ features including movies, user profiles, music, sports, podcasts, creator submissions, access control, and blockchain-based revenue sharing using OrderedMap collections.",
  "feature_evidence.json": "Feature evidence report documenting mobile scrolling fixes and mobile compatibility verification testing, linking specific frontend components and test requirements (REQ-13, REQ-14) with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components detailing mobile optimization fixes including scroll behavior, touch-action directives, viewport handling, and responsive layouts across all major UI components.",
  "frontend/DEPLOYMENT.md": "Production deployment guide with pre-deployment checklist covering environment configuration, security, GDPR compliance, performance optimization, testing, and monitoring requirements.",
  "frontend/index.html": "Main HTML entry point with critical mobile viewport configuration, PWA meta tags, service worker support, preconnect optimization, and early error detection script for mobile compatibility.",
  "frontend/public/manifest.json": "PWA manifest defining TamriStream as a standalone mobile app with theme colors, icons, orientation settings, and categorization for entertainment/video/music.",
  "frontend/public/sw.js": "Service worker implementing network-first caching strategy with cache versioning, asset pre-caching, old cache cleanup, and offline fallback page for PWA functionality.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router configuration for 75+ routes, QueryClient setup, theme provider, service worker registration, error boundaries, and comprehensive layout structure with Header/Footer.",
  "frontend/src/components/AdminApprovalDashboard.tsx": "Admin interface for reviewing and approving/rejecting creator content submissions, organized in tabs by status (pending, approved, rejected) with feedback functionality.",
  "frontend/src/components/AdminPartnershipDashboard.tsx": "Admin dashboard for managing the First 100 African Creators partnership program applications, showing stats, reviewing applications, and tracking available slots.",
  "frontend/src/components/AdvancedAnalyticsDashboard.tsx": "Displays comprehensive analytics for content creators including views, earnings, engagement rates, top content performance, audience demographics, revenue breakdown, and performance metrics with filtering by time period and content type.",
  "frontend/src/components/AIContentModeration.tsx": "React component displaying an AI-powered content moderation dashboard with flagged content review, approval/rejection actions, severity indicators, and moderation statistics.",
  "frontend/src/components/AIIndieDiscovery.tsx": "Component that uses AI logic to discover and display hidden gem indie African films with low visibility but high ratings, includes tooltips explaining the discovery algorithm.",
  "frontend/src/components/AIPersonalizationDashboard.tsx": "Tabbed dashboard component integrating AI indie discovery, multi-language subtitles, and transparent ranking features for personalized content exploration.",
  "frontend/src/components/ArtistDashboard.tsx": "Provides artist profile management and music track upload functionality with file upload progress tracking, revenue share display, and payment method configuration using custom hooks for backend integration.",
  "frontend/src/components/AudienceRewardsSection.tsx": "Manages audience engagement rewards system with token balance display, reward history, referral program, NFT collectibles, missions/challenges, and social sharing features to incentivize user participation.",
  "frontend/src/components/BandwidthSettingsPanel.tsx": "Allows users to configure video quality settings and autoplay preferences separately for WiFi and cellular connections, with connection speed testing integration for bandwidth optimization.",
  "frontend/src/components/BulkUploadForm.tsx": "Enables batch uploading of multiple movies with drag-and-drop support, individual progress tracking per item, and file management for posters and trailers with validation and error handling.",
  "frontend/src/components/BusinessModelSection.tsx": "Displays TamriStream's pricing and business model information including subscription tiers, partnership benefits, and flexible access options with a hero section, badges, and visual infographic layout.",
  "frontend/src/components/ComingSoonSection.tsx": "Shows upcoming movie releases with thumbnails, release dates, countdown timers, and notification functionality allowing users to set reminders for new content.",
  "frontend/src/components/CommunityPlaylistsSection.tsx": "Manages community-created music video playlists with features for following, liking, searching, filtering by category, and creating new playlists with mock data for Nollywood soundtracks and African music.",
  "frontend/src/components/CommunityStakingSection.tsx": "Implements a token staking system where users can stake tokens on movies or artists to earn rewards, showing staking pools with APY rates, durations, and exclusive perks like early access and behind-the-scenes content.",
  "frontend/src/components/CommunityVoting.tsx": "Provides community polling functionality for voting on featured movies, best films, and upcoming releases with real-time vote tracking, progress bars, and status indicators for active/closed polls.",
  "frontend/src/components/ConnectionSpeedTest.tsx": "A React component that tests and displays internet connection speed (download, upload, latency) with quality recommendations for video streaming. Uses a custom hook `useConnectionSpeedTest` and displays results with progress indicators and speed ratings.",
  "frontend/src/components/CreatorAcademy.tsx": "A full-page React component displaying an educational platform with courses, achievements, and progress tracking for creators. Includes mock course data with categories like filmmaking and music production, plus achievement badges and course completion functionality.",
  "frontend/src/components/CreatorAcademySection.tsx": "A section component showcasing the Creator Academy platform with featured courses, statistics (students, certifications), and navigation to the full academy. Highlights free training for African youth in filmmaking, video editing, and blockchain literacy.",
  "frontend/src/components/CreatorDAOInterface.tsx": "A governance interface component for a decentralized autonomous organization (DAO) where creators can view, vote on, and submit proposals related to platform policies, revenue shares, and features. Includes proposal management, voting statistics, and status tracking.",
  "frontend/src/components/CreatorDashboard.tsx": "A creator dashboard component for managing revenue share, payment methods, and payout history. Supports multiple payment options including crypto wallets (ICP, USDT, USDC), mobile money (M-Pesa), and traditional payment processors (Stripe, Paystack).",
  "frontend/src/components/CreatorFirstHero.tsx": "Hero section component highlighting TamriStream's creator-first value proposition with 70-90% revenue share, on-chain transparency, and instant payouts. Features gradient backgrounds, key feature cards, and CTA buttons for creator signup and platform exploration.",
  "frontend/src/components/CreatorFollowingSection.tsx": "Component for managing creator follows and notifications with tabs for following/discover views. Displays mock creator profiles with stats, specialties, and recent work, plus notification feed for new releases and announcements.",
  "frontend/src/components/CreatorNeuralStudio.tsx": "AI-powered content analysis tool that simulates analyzing uploaded videos/audio for pacing, engagement predictions, quality checks, and optimization recommendations. Features progress tracking and mock analysis results with scores and suggestions.",
  "frontend/src/components/CreatorOnboardingProgram.tsx": "Learning program interface displaying onboarding modules for new creators with progress tracking. Shows four modules covering platform basics, content guidelines, upload process, and revenue analytics with completion status.",
  "frontend/src/components/CreatorPortal.tsx": "Main creator portal with film submission form and tabs for various creator features. Includes bold promise banner about revenue share, form handling with validation, and navigation to additional creator tools like revenue models and future add-ons.",
  "frontend/src/components/CreatorSpotlightSection.tsx": "Displays a tabbed section showcasing featured African creators (filmmakers and musicians) with profiles, achievements, recent work, and follow/unfollow functionality.",
  "frontend/src/components/CreatorVerificationForm.tsx": "Form component for creators to submit verification requests with contact info, creator type, and identity documents; displays verification status (pending/approved/rejected) if already submitted.",
  "frontend/src/components/CulturalKnowledgeGraph.tsx": "Semantic AI-powered knowledge graph interface that visualizes connections between African creators, cultural influences, genres, and regions with collaboration suggestions based on compatibility scores.",
  "frontend/src/components/DailyChallenges.tsx": "Gamification component displaying daily challenges (watch, social, engage, discover categories) with progress tracking, point rewards, and completion status.",
  "frontend/src/components/DataUsageEstimator.tsx": "Displays estimated data usage in MB/GB for different video quality levels (240p-1080p) based on playback duration, with bandwidth-based quality recommendations.",
  "frontend/src/components/DataUsageIndicator.tsx": "Real-time badge component that tracks and displays current session data usage during video playback, with color-coded warnings based on consumption levels.",
  "frontend/src/components/DataUsageSettings.tsx": "Displays data usage statistics with daily, weekly, and monthly tracking against predefined limits, showing progress bars and formatted sizes. Includes a reset functionality with confirmation dialog and calculates average usage per session.",
  "frontend/src/components/DiagnosticsPage.tsx": "System diagnostics dashboard showing build information, backend health status, service worker diagnostics, and runtime errors. Provides controls for checking updates, clearing cache, and managing errors with visual status indicators.",
  "frontend/src/components/DynamicTokenizedEcosystem.tsx": "Mock tokenized economy interface displaying wallet balances, creator tokens, NFT badges, staking pools, and reward tiers. Includes tipping and staking functionality with form inputs and toast notifications.",
  "frontend/src/components/EnhancedCreatorDashboard.tsx": "Creator analytics dashboard showing real-time streaming metrics, earnings, viewer countries, and royalties. Displays content approval status and smart royalties data fetched from blockchain queries.",
  "frontend/src/components/EnhancedErrorDisplay.tsx": "Error display component that categorizes errors (network, auth, permission, validation) and shows contextual messages with icons, suggestions, and retry/home navigation buttons. Formats error messages in a user-friendly card layout.",
  "frontend/src/components/EnhancedMovieUploadForm.tsx": "Form component for uploading movies with metadata (title, description, video/poster files, genre, cast, crew), contributor management with revenue split validation, and integration with creator verification and content approval submission hooks.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and categorizes errors (network, auth, module, render), logs them to localStorage, and provides recovery options including cache clearing and page reload with user-friendly error messages.",
  "frontend/src/components/FanClubsSection.tsx": "Displays fan clubs with tiered memberships (bronze/silver/gold/platinum), showing creator info, member counts, monthly fees, benefits, and join/leave functionality with tabs for all clubs and user's clubs.",
  "frontend/src/components/FanRewardsSection.tsx": "Fan rewards and loyalty system with point tracking, tier progression (Bronze/Silver/Gold/Platinum), redeemable rewards across categories (content, events, merchandise, experiences), and activity tracking for earning points.",
  "frontend/src/components/FeaturedMovieSlider.tsx": "Auto-playing carousel slider for featured movies with navigation controls, displaying movie posters, titles, descriptions, ratings, and action buttons for watching trailers or selecting movies.",
  "frontend/src/components/FeaturedSportsSlider.tsx": "A carousel component that displays featured sports content with auto-play functionality, navigation controls, and displays metadata like access tier, sport type, and ratings with gradient overlays on thumbnail images.",
  "frontend/src/components/FilmmakerUploadSection.tsx": "A form component for filmmakers to submit their films for review, collecting details like title, director, description, cast, category, and rights verification with validation and toast notifications.",
  "frontend/src/components/Footer.tsx": "A footer component with navigation links organized into Company, Content, and Creators sections, plus social media icons and trust badges for security and privacy.",
  "frontend/src/components/FutureAddOnsSection.tsx": "Displays upcoming platform features (NFT ownership, referral system, community DAO, mobile money integration) with descriptions, benefits, release dates, and notification signup functionality.",
  "frontend/src/components/GDPRConsentBanner.tsx": "A fixed bottom banner that prompts users for GDPR cookie consent with accept/decline options, storing preferences in localStorage and linking to privacy policy.",
  "frontend/src/components/GenresSection.tsx": "Displays a grid of movie genres (Drama, Comedy, Action, Romance, Thriller, Family) with icons, gradient colors, and hover effects for genre exploration.",
  "frontend/src/components/GeoTargetedContent.tsx": "Displays regional content discovery interface with region selector, trending content by region, and geo-targeted movie/music recommendations for different African regions.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile menus, authentication button using Internet Identity, and route navigation handling.",
  "frontend/src/components/HeroBanner.tsx": "Landing page hero section with background image, headline text about African cinema streaming, and dual CTA buttons for watching/browsing movies.",
  "frontend/src/components/HowItWorksSection.tsx": "Explains the platform's three-step onboarding process (sign up, choose plan, start streaming) and highlights key benefits like affordable pricing, data saver mode, and creator support.",
  "frontend/src/components/InAppEventsSection.tsx": "Manages virtual events like Q&As, film festivals, listening parties, and premieres with event listings, participant management, live chat, and event creation dialogs.",
  "frontend/src/components/InstallPromptBanner.tsx": "Shows a dismissible banner prompting users to install the PWA, with platform-specific instructions for iOS and an install button for other platforms.",
  "frontend/src/components/InstantPayoutsSection.tsx": "Marketing section component showcasing instant payout features with crypto (ICP, BTC, ETH, USDC) and fiat (mobile money, M-Pesa) options. Displays benefits, payment methods, and statistics with gradient cards and icons.",
  "frontend/src/components/InstantWithdrawalSection.tsx": "Functional withdrawal interface allowing users to withdraw earnings to crypto wallets (ICP, USDT, USDC). Includes balance display, withdrawal form with validation, minimum withdrawal limits, and demo mode alert.",
  "frontend/src/components/InteractiveLearningGames.tsx": "Educational quiz game component with multiple categories (geography, culture, wildlife) featuring African-themed questions. Tracks game progress, scores, and provides explanations for answers.",
  "frontend/src/components/InteractiveTrivia.tsx": "Multiplayer trivia game component focused on African cinema and Nollywood knowledge. Features timed questions with difficulty levels, scoring with multipliers, streak tracking, and participant leaderboards.",
  "frontend/src/components/KidsZoneSection.tsx": "Kids content section with age-grouped African-themed educational content (movies, music, games). Includes parental controls, watch time tracking, achievements system, and content filtering by age and type.",
  "frontend/src/components/Leaderboards.tsx": "Displays leaderboard rankings across four categories (top reviewers, most active users, watch party hosts, trivia champions) with sample data, rank icons, badges, and change indicators using tabs and cards.",
  "frontend/src/components/LiveMatchPreview.tsx": "Shows live and upcoming African sports match previews with countdown timers, match details, and real-time updates in a gradient card layout with loading states.",
  "frontend/src/components/LivePolls.tsx": "Implements real-time interactive polls during movie premieres with voting, countdown timers, live results visualization, and participant tracking for predictions, opinions, trivia, and reactions.",
  "frontend/src/components/LivePremiereEvents.tsx": "Manages live premiere events for movies, music, and documentaries with RSVP, chat, Q&A, polls, and special guest features including status tracking and attendee management.",
  "frontend/src/components/LoadingScreen.tsx": "Renders a branded loading screen with animated logo, progress bar, and customizable loading messages for the TamriStream application.",
  "frontend/src/components/LocalFilmHubsSection.tsx": "Showcases regional African film hubs partnered with universities and media houses, displaying hub details, equipment access, member counts, and partnership information with an interactive map.",
  "frontend/src/components/LoginScreen.tsx": "Landing page component that displays hero banners, creator empowerment sections, payment models, and various feature showcases. Handles Internet Identity authentication and navigation to the main app.",
  "frontend/src/components/MerchandiseStore.tsx": "E-commerce component for creator merchandise with browsing, cart management, and order tracking. Supports both physical and digital items with categories, ratings, and limited edition products.",
  "frontend/src/components/MessagingCenter.tsx": "Messaging interface for communication between users and creators. Displays conversation lists, message threads, and handles sending new messages.",
  "frontend/src/components/MovieCard.tsx": "Reusable card component displaying movie information with poster, title, rating, and action buttons. Includes hover effects and navigation to movie details and transparency pages.",
  "frontend/src/components/MovieCatalog.tsx": "Main movie browsing interface with search functionality and grid layout. Features AI-powered indie discovery section and integrates with movie data queries.",
  "frontend/src/components/MovieDialog.tsx": "Modal dialog for detailed movie view with video player, rating system, and action buttons. Handles video playback, quality settings, and navigation to watch parties and transparency pages.",
  "frontend/src/components/MovieNightCalendar.tsx": "React component for scheduling and managing movie watch parties with invitees, dates, times, and status tracking. Includes a dialog for creating new movie nights and displays them in list or calendar view.",
  "frontend/src/components/MovieTransparencyPage.tsx": "Displays blockchain-verified transparency data for a specific movie including views, earnings, revenue breakdown, and viewer analytics. Integrates with Internet Computer blockchain and provides links to blockchain explorer.",
  "frontend/src/components/MultiLanguageSubtitles.tsx": "UI component for managing subtitle and audio language selection across 10+ languages with AI-powered translation, subtitle size adjustment, and cultural context options.",
  "frontend/src/components/MusicStreamingSection.tsx": "Full-featured music streaming interface with audio playback controls, playlist management, search, categorization by genre (Afrobeats, Highlife, etc.), and artist profiles. Includes queue management and volume controls.",
  "frontend/src/components/MusicVideosSection.tsx": "Music video browsing and playback component with search, genre filtering, playlist creation, and featured playlists. Displays videos in a grid with dialog-based video player.",
  "frontend/src/components/OfflineIndicator.tsx": "Badge component that displays offline status with tooltip showing cached content availability and last online timestamp. Only visible when user is offline.",
  "frontend/src/components/OnChainPaymentsSection.tsx": "Marketing section component that highlights blockchain-based payment transparency features, including verified transactions, real-time tracking, and security benefits on the Internet Computer blockchain.",
  "frontend/src/components/OptimizedImage.tsx": "Reusable image component with WebP support, responsive srcsets, lazy loading, skeleton loading states, and configurable aspect ratios for performance optimization.",
  "frontend/src/components/OwnershipTrackingSection.tsx": "Marketing section showcasing blockchain-verified content ownership features, including NFT certificates, usage analytics, and rights tracking with visual dashboard preview.",
  "frontend/src/components/PartnershipApplicationForm.tsx": "Form component for creators to apply to the First 100 Partnership Program, displaying application status (pending/approved/rejected) and handling submission with validation.",
  "frontend/src/components/PartnershipOfferSection.tsx": "Marketing section displaying the limited-time First 100 African Creators partnership offer with real-time slot availability, progress bar, and benefits list.",
  "frontend/src/components/PaymentOptions.tsx": "Informational component with tabbed interface explaining available payment methods for users (crypto, stablecoins, traditional) and withdrawal options for creators.",
  "frontend/src/components/PersonalizedRecommendations.tsx": "React component that generates and displays personalized movie and music recommendations based on user favorites and viewing history, with feedback mechanisms and confidence scoring.",
  "frontend/src/components/PodcastsRadioSection.tsx": "React component providing podcast episodes and live radio station streaming with audio playback controls, search functionality, and volume/speed adjustments.",
  "frontend/src/components/PrivacyPolicy.tsx": "Static React component displaying TamriStream's privacy policy with sections on data collection, usage, security, and user rights for the African entertainment streaming platform.",
  "frontend/src/components/ProductionReadinessCheck.tsx": "Admin-only React component that performs production readiness checks across security, compliance, and infrastructure categories, with partnership offer initialization functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for new user onboarding that collects user name and creates initial profile with empty favorites and watch history.",
  "frontend/src/components/RevenueModelDisplay.tsx": "React component that visualizes TamriStream's creator revenue-sharing model across multiple income streams (subscriptions, ads, pay-per-view, tips, merchandise) with transparent percentage breakdowns.",
  "frontend/src/components/ReviewerDashboard.tsx": "Dashboard component for film reviewers to view and manage filmmaker submissions, displaying pending, approved, and rejected submissions in tabbed views with action buttons for review, approval, and rejection.",
  "frontend/src/components/SmartRoyaltiesDashboard.tsx": "Comprehensive dashboard for creators to track blockchain-based royalty earnings, view payment history, and monitor royalty events with detailed tables showing earnings, content performance, and transaction history.",
  "frontend/src/components/SmartRoyaltiesSection.tsx": "Marketing/informational section explaining the Smart Royalties system features including unique canister IDs, event logging, auto distribution, and blockchain-powered transparent payments with feature cards and infographic.",
  "frontend/src/components/SmartTVInterface.tsx": "Smart TV optimized interface component showcasing a living room experience with remote control navigation, large-screen UI, and featured content display for movies, music, and sports.",
  "frontend/src/components/SocialSharingSection.tsx": "Social media integration component with community feed, sharing capabilities to multiple platforms (Facebook, Twitter, Instagram, WhatsApp), and display of user-shared content including movies, music, achievements, and playlists.",
  "frontend/src/components/SportsContentCard.tsx": "Reusable card component for displaying sports content with thumbnail, title, description, ratings, access tier badges, and hover effects for play functionality.",
  "frontend/src/components/SportsCreatorDashboard.tsx": "Dashboard component for sports content creators to submit content, track submissions, view revenue share, and manage payment methods (mobile money, M-Pesa, crypto). Includes form handling, status tracking, and payment method configuration.",
  "frontend/src/components/SportsSection.tsx": "Main sports content browsing component with search, category filtering, live match previews, and featured sports slider. Displays sports content cards with debounced search and loading/error states.",
  "frontend/src/components/SystemHealthMonitor.tsx": "Health monitoring component that performs periodic checks on backend actor connectivity, displays connection status alerts, and implements auto-retry logic with exponential backoff for failed connections.",
  "frontend/src/components/TamriGrantsPortal.tsx": "DAO-governed grants portal for eco-friendly, cultural, and educational projects. Displays active grants with funding progress, voting functionality, and proposal submission form with mock data.",
  "frontend/src/components/TamriIntelligenceHub.tsx": "Unified AI-powered intelligence hub displaying insights, recommendations, and navigation to specialized modules (Neural Studio, Knowledge Graph, Tokenized Ecosystem, Grants Portal) with metrics and analytics.",
  "frontend/src/components/TamriOriginalsSection.tsx": "Displays community-funded African original series and films with DAO voting, funding progress, and revenue sharing features. Shows project cards with funding goals, backers, and status badges.",
  "frontend/src/components/TechnicalDocumentation.tsx": "Technical architecture documentation component with tabbed interface covering overview, frontend, backend, storage, payments, and analytics. Details the Internet Computer Protocol implementation with React and Motoko.",
  "frontend/src/components/TermsOfService.tsx": "Static Terms of Service page displaying legal agreements, use licenses, user account requirements, subscription/payment terms, and platform rules. Includes sections with icons for visual organization.",
  "frontend/src/components/TopPicksSection.tsx": "Displays curator-recommended movies as top picks with ratings, reviews, and curator information. Uses TopPickCard component that fetches movie data and handles loading states.",
  "frontend/src/components/TopPicksSectionWrapper.tsx": "Wrapper component that manages state for TopPicksSection, fetches top picks data, and handles movie selection with dialog display. Integrates MovieDialog for detailed movie views.",
  "frontend/src/components/TrailersSection.tsx": "Displays movie trailers organized by categories (Latest, Popular, Coming Soon) with play buttons and ratings. Opens trailer dialog on click with mock trailer data.",
  "frontend/src/components/TransparentRanking.tsx": "Displays a transparent ranking system component that shows how content is ranked using five weighted factors (view count, engagement, quality, creator activity, recency) with detailed explanations and an accordion for additional information.",
  "frontend/src/components/TriviaGame.tsx": "Implements an interactive trivia game about African cinema with timed questions, score tracking, and multiple difficulty levels covering topics like Nollywood, film festivals, and African filmmakers.",
  "frontend/src/components/UnlockableContentSection.tsx": "Manages unlockable premium content (director's cuts, behind-the-scenes, early access) that users can unlock through various criteria like badges, streaks, challenges, or token staking, with rarity levels and progress tracking.",
  "frontend/src/components/UploadMovieForm.tsx": "Provides a form for uploading movies with title, description, poster, and trailer files, handling file uploads with progress tracking and integrating with backend mutation hooks.",
  "frontend/src/components/UserGeneratedPlaylistsSection.tsx": "Enables users to create, discover, and manage custom playlists of movies and music with features like following, liking, tagging, and filtering, displaying playlist metadata and items.",
  "frontend/src/components/UserProfile.tsx": "User profile page component displaying user information, quick access cards to features (Audience Rewards, AI Personalization), favorite movies, watch party history, and settings tabs including data usage and bandwidth controls.",
  "frontend/src/components/VideoQualitySelector.tsx": "Popover component for selecting video quality settings with auto/manual quality selection, bandwidth monitoring display, and low bandwidth mode toggle using connection speed detection.",
  "frontend/src/components/VideoReviewsSection.tsx": "Displays a grid of video reviews with thumbnails, user avatars, ratings, and interaction buttons (like, comment, share) for community-generated movie reviews.",
  "frontend/src/components/VirtualFilmFestival.tsx": "Virtual film festival interface showing upcoming, live, and past events with RSVP functionality, event details including speakers, Q&A sessions, and premiere screenings.",
  "frontend/src/components/VoiceSearchInterface.tsx": "Voice-activated search interface with microphone button, speech-to-text transcript display, and mock search results for movies, music, and sports content using natural language commands.",
  "frontend/src/components/WatchPartyView.tsx": "Main watch party component that displays a video player with synchronized playback controls, live chat, reaction system with emojis, and participant list. Integrates with backend queries for watch party and movie data, and manages video state including play/pause, muting, and current time tracking.",
  "frontend/src/components/WatchPartyViewWrapper.tsx": "Router wrapper component that extracts partyId from URL params and passes it to WatchPartyView, handling navigation back to movies list.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control for authenticated users and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdaptiveStreaming.ts": "Hook for adaptive video quality streaming that automatically adjusts quality levels based on bandwidth monitoring and low-bandwidth mode, managing quality transitions, buffer health, and manual quality overrides.",
  "frontend/src/hooks/useBackendHealthStatus.ts": "React Query hook that periodically checks backend health by calling a lightweight API method, returning health status (Healthy/Degraded/Offline) with error details and last successful check timestamp.",
  "frontend/src/hooks/useBandwidthMonitor.ts": "Hook that monitors network connection quality using the Network Information API, detecting connection type (2G/3G/4G/WiFi), downlink speed, RTT, and data saver mode to recommend appropriate video quality levels.",
  "frontend/src/hooks/useBandwidthSettings.ts": "Hook for managing user bandwidth preferences stored in localStorage, including default quality settings for WiFi and cellular, autoplay preferences, and data saver mode toggles.",
  "frontend/src/hooks/useConnectionSpeedTest.ts": "Hook that performs network speed tests by fetching resources and measuring download/upload speeds and latency, providing real-time connection performance metrics.",
  "frontend/src/hooks/useDataUsageTracker.ts": "Hook that tracks video streaming data usage across daily/weekly/monthly periods, estimates data consumption based on quality level and duration, and persists session history to localStorage.",
  "frontend/src/hooks/useInstallPrompt.ts": "Hook for managing Progressive Web App (PWA) installation prompts, detecting installability, handling beforeinstallprompt events, tracking install/dismiss state in localStorage, and providing iOS-specific detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLowBandwidthMode.ts": "React hook for managing low bandwidth mode and quality override settings, persisting preferences to localStorage for video streaming optimization.",
  "frontend/src/hooks/useOfflineStatus.ts": "React hook that monitors online/offline status using navigator.onLine and checks for cached content availability via the Cache API.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive React Query hooks for backend API calls including movies, user profiles, ratings, creator submissions, revenue sharing, music tracks, sports content, and admin operations with mock implementations for features not yet in backend.",
  "frontend/src/hooks/useRecentRuntimeErrors.ts": "React hook that captures and tracks the last 20 runtime errors and unhandled promise rejections with timestamps and stack traces.",
  "frontend/src/hooks/useServiceWorkerDiagnostics.ts": "React hook providing service worker diagnostics, update checking, cache clearing, and registration management with detailed status reporting.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, brand colors (amber/gold primary), shadow utilities, animations, and mobile-optimized scrolling behavior.",
  "frontend/src/lib/imageOptimization.ts": "Provides image optimization utilities including responsive srcset generation with WebP conversion, lazy loading helpers, image preloading for LCP optimization, and client-side WebP conversion for user uploads.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/sw/registerServiceWorker.ts": "Handles service worker registration with automatic update checking, version management, cache clearing utilities, and controller change detection for mobile support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme colors (HSL-based design tokens), container settings, border radius variables, brand shadows, and animation keyframes for accordion and wave effects.",
  "project_state.json": "Project state tracking document listing known mobile compatibility issues (scrolling, touch events, viewport rendering) and existing features focused on diagnosing and fixing mobile device functionality.",
  "unknown.txt": "Deployment checklist and rollback plan template covering pre-deployment verification, production deployment steps, post-deployment monitoring, and support contact placeholders."
}