{
  "backend/main.mo": "Main Motoko actor for TamriStream backend with comprehensive state management for 50+ features including movies, user profiles, ratings, creator submissions, watch parties, music/sports/podcast content, kids zone, blockchain payments, and access control integration.",
  "feature_evidence.json": "Feature evidence report documenting implementation of low-bandwidth mode toggle, data usage indicators, and PWA features with associated files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx routing, Header navigation, LoginScreen landing page, MovieCatalog with AI discovery, MovieDialog with quality selector, and 75+ feature implementations.",
  "frontend/DEPLOYMENT.md": "Production deployment guide with pre-deployment checklist covering environment configuration, security, GDPR compliance, performance optimization, testing, and monitoring requirements.",
  "frontend/index.html": "Main HTML entry point with PWA manifest link, meta tags for theme color and description, favicon configuration, and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining TamriStream app metadata, icons, display mode (standalone), theme colors, and categorization for installation on mobile devices.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with versioning, asset caching for offline support, automatic cache cleanup, and network-first fallback for HTML pages.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router configuration for 75+ routes, service worker registration, QueryClientProvider setup, theme provider, error boundaries, and comprehensive layout with Header/Footer.",
  "frontend/src/components/AdminApprovalDashboard.tsx": "Admin interface for reviewing and approving/rejecting creator content submissions with tabs for pending, approved, and rejected items, includes feedback functionality.",
  "frontend/src/components/AdminPartnershipDashboard.tsx": "Admin dashboard for managing the First 100 African Creators partnership program applications, showing stats, reviewing applications, and tracking available slots.",
  "frontend/src/components/AdvancedAnalyticsDashboard.tsx": "React component displaying comprehensive analytics for content creators including views, earnings, engagement metrics, top content performance, audience demographics, revenue breakdown, and performance trends with filtering by time period and content type.",
  "frontend/src/components/AIContentModeration.tsx": "React component displaying an AI-powered content moderation dashboard with flagged content review, approval/rejection actions, severity indicators, and moderation statistics.",
  "frontend/src/components/AIIndieDiscovery.tsx": "Component that uses AI logic to discover and display hidden gem indie African films with low review counts but high ratings, includes tooltips explaining the discovery algorithm.",
  "frontend/src/components/AIPersonalizationDashboard.tsx": "Tabbed dashboard component combining AI indie discovery, multi-language subtitles, and transparent ranking features with a unified personalization interface.",
  "frontend/src/components/ArtistDashboard.tsx": "React component for artist profile management and music track uploads, integrating with backend queries for profile creation, track management, revenue sharing, and file uploads with progress tracking for audio and cover art.",
  "frontend/src/components/AudienceRewardsSection.tsx": "React component managing audience engagement rewards system with TAMRI token balance, reward history, referral stats, NFT collectibles, engagement activities (watch, rate, review, share), active missions with progress tracking, and referral link generation.",
  "frontend/src/components/BandwidthSettingsPanel.tsx": "React component providing bandwidth and data usage settings with separate configurations for WiFi and cellular connections, including video quality selection, autoplay toggles, and connection speed testing integration.",
  "frontend/src/components/BulkUploadForm.tsx": "React component for bulk uploading multiple movies with drag-and-drop support, managing poster and trailer files for each movie item, tracking individual upload progress, and coordinating batch uploads with status monitoring.",
  "frontend/src/components/BusinessModelSection.tsx": "Displays TamriStream's flexible pricing structure including subscription tiers, partnership benefits, and payment options with a hero section, business model infographic, and detailed pricing cards. Uses custom hooks to fetch business model data and renders loading/error states.",
  "frontend/src/components/ComingSoonSection.tsx": "Shows upcoming movie releases with countdown timers, notification reminders, and movie details (genre, director, release date). Allows users to set notifications for releases and displays days until each movie becomes available.",
  "frontend/src/components/CommunityPlaylistsSection.tsx": "Manages community-created music video playlists with features for following, liking, searching, and filtering by category. Includes dialog for creating new playlists and displays playlist metadata like follower count, likes, and last updated time.",
  "frontend/src/components/CommunityStakingSection.tsx": "Implements a token staking system where users can stake tokens on movies or artists to earn rewards and APY. Features staking pools with details like total staked amount, APY rates, minimum stakes, and exclusive rewards like early access and behind-the-scenes content.",
  "frontend/src/components/CommunityVoting.tsx": "Provides community polling functionality for voting on featured movies, best films, and upcoming releases. Displays poll options with vote counts, percentages, progress bars, and handles vote submission with status tracking (active/closed).",
  "frontend/src/components/ConnectionSpeedTest.tsx": "A React component that tests and displays internet connection speed (download, upload, latency) with quality recommendations for video streaming. Uses a custom hook `useConnectionSpeedTest` and displays results with progress indicators and speed ratings.",
  "frontend/src/components/CreatorAcademy.tsx": "A full-page React component displaying an educational platform with courses, achievements, and progress tracking for creators. Includes mock course data with categories like filmmaking and music production, plus achievement badges and course completion functionality.",
  "frontend/src/components/CreatorAcademySection.tsx": "A landing section component showcasing the Creator Academy platform with featured courses, statistics (students, certifications), and navigation to the full academy. Emphasizes free training for African youth in filmmaking, video editing, and blockchain.",
  "frontend/src/components/CreatorDAOInterface.tsx": "A DAO governance interface component allowing creators to view, vote on, and submit proposals related to platform policies, revenue shares, and features. Includes proposal status tracking, voting power display, and mock governance data.",
  "frontend/src/components/CreatorDashboard.tsx": "A creator dashboard component for managing revenue shares, payment methods (crypto, mobile money, traditional), and viewing payout history. Integrates with backend queries and mutations for payment method updates and revenue tracking.",
  "frontend/src/components/CreatorFirstHero.tsx": "Hero section component promoting TamriStream's creator-first platform with emphasis on 70-90% revenue share, on-chain transparency, and instant payouts. Features gradient backgrounds, badges, key feature cards, and CTA buttons for creator signup and revenue model exploration.",
  "frontend/src/components/CreatorFollowingSection.tsx": "Component for managing creator following/followers with tabs for discovery, following list, and notifications. Includes mock data for creators (with profiles, specialties, ratings) and notifications, with search/filter functionality and follow/unfollow actions.",
  "frontend/src/components/CreatorNeuralStudio.tsx": "AI-powered content analysis tool for creators that simulates analyzing uploaded video/audio files and provides mock insights on pacing, engagement predictions, quality metrics, and optimization recommendations. Features progress tracking and tabbed results display.",
  "frontend/src/components/CreatorOnboardingProgram.tsx": "Learning program component displaying a modular onboarding curriculum for new creators with progress tracking. Shows four modules (Getting Started, Content Guidelines, Upload & Distribution, Revenue & Analytics) with completion status and duration.",
  "frontend/src/components/CreatorPortal.tsx": "Main creator portal component with film submission form, revenue model display, and future add-ons section. Features prominent messaging about TamriStream's superior per-view payments and blockchain verification, with tabs for submission, revenue info, and upcoming features.",
  "frontend/src/components/CreatorSpotlightSection.tsx": "Displays a tabbed section showcasing featured African creators (filmmakers and musicians) with profiles, achievements, recent work, and follow functionality. Includes mock data for creators from Nigeria, Ghana, Kenya, and Senegal with stats like followers, views, and ratings.",
  "frontend/src/components/CreatorVerificationForm.tsx": "Form component for creators to submit verification requests with contact info, creator type, and identity documents. Displays verification status (pending/verified/rejected) with submission and verification dates using custom hooks for API integration.",
  "frontend/src/components/CulturalKnowledgeGraph.tsx": "Semantic AI-powered knowledge graph interface that visualizes connections between African creators, cultural influences, and collaboration opportunities. Features search, mock graph data for creators/connections, and collaboration suggestions based on compatibility scores.",
  "frontend/src/components/DailyChallenges.tsx": "Gamification component displaying daily challenges (watch, social, engage, discover categories) with progress tracking, point rewards, and completion status. Shows progress overview with total points earned and completed challenge count.",
  "frontend/src/components/DataUsageEstimator.tsx": "Displays estimated data usage for different video quality levels (240p-1080p) based on playback duration. Integrates with bandwidth monitor to recommend optimal quality and shows usage in MB/GB.",
  "frontend/src/components/DataUsageIndicator.tsx": "Real-time badge component that tracks and displays current session data usage during video playback. Updates every 10 seconds and uses color coding (green/yellow/red) to indicate usage levels.",
  "frontend/src/components/DataUsageSettings.tsx": "Displays data usage statistics with daily, weekly, and monthly progress bars against predefined limits, includes session tracking and reset functionality using a custom hook.",
  "frontend/src/components/DiagnosticsPage.tsx": "System diagnostics dashboard showing build information, backend health status, service worker status, and runtime errors with controls for updates and cache clearing.",
  "frontend/src/components/DynamicTokenizedEcosystem.tsx": "Tokenized economy interface displaying wallet balances, creator tokens, NFT badges, staking pools, and reward tiers with tipping and staking functionality using mock data.",
  "frontend/src/components/EnhancedCreatorDashboard.tsx": "Creator analytics dashboard showing real-time streaming metrics, earnings, content approvals, and smart royalties data fetched from blockchain queries.",
  "frontend/src/components/EnhancedErrorDisplay.tsx": "Error display component that categorizes errors by type (network, auth, permission, validation) and provides contextual messages with retry and navigation actions.",
  "frontend/src/components/EnhancedMovieUploadForm.tsx": "Form component for uploading movies with metadata (title, description, video/poster files, genre, cast, crew), contributor revenue split management, and submission for approval with NFT/canister ID generation.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with options to refresh or navigate home, showing error details in development mode.",
  "frontend/src/components/FanClubsSection.tsx": "Displays fan clubs with tiered memberships (bronze/silver/gold/platinum), allowing users to join/leave clubs and view benefits, member counts, and monthly fees.",
  "frontend/src/components/FanRewardsSection.tsx": "Manages user reward points system with tiered levels, redeemable rewards across categories (content, events, merchandise, experiences), and activity tracking for earning points.",
  "frontend/src/components/FeaturedMovieSlider.tsx": "Auto-playing carousel slider displaying featured movies with cover images, ratings, descriptions, and navigation controls for browsing movie highlights.",
  "frontend/src/components/FeaturedSportsSlider.tsx": "Auto-playing carousel for featured sports content with thumbnails, access tier badges, sport type labels, and navigation controls.",
  "frontend/src/components/FilmmakerUploadSection.tsx": "React component providing a form for filmmakers to submit their films for review and distribution, including fields for title, director, description, category, and other metadata with validation and toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer component with navigation links organized into Company, Content, and Creators sections, plus social media icons and programmatic navigation using TanStack Router.",
  "frontend/src/components/FutureAddOnsSection.tsx": "Displays upcoming platform features (NFT ownership, referral system, community DAO, mobile money integration) with descriptions, benefits, release timelines, and notification signup functionality.",
  "frontend/src/components/GDPRConsentBanner.tsx": "Cookie consent banner component that appears at the bottom of the page, allowing users to accept or decline GDPR-compliant data collection with localStorage persistence.",
  "frontend/src/components/GenresSection.tsx": "Displays a grid of movie genres (Drama, Comedy, Action, Romance, Thriller, Family) with icons, gradient colors, and hover effects for genre exploration.",
  "frontend/src/components/GeoTargetedContent.tsx": "Component for discovering region-specific African content with a region selector (West, East, Southern, North, Central Africa) and displays trending content by geographic area.",
  "frontend/src/components/Header.tsx": "Main navigation header component with logo, desktop/mobile menus, authentication controls via Internet Identity, and admin dropdown menu for content approval, partnerships, and diagnostics.",
  "frontend/src/components/HeroBanner.tsx": "Landing page hero section with background image, gradient overlays, headline text about African cinema streaming, and dual CTA buttons for starting to watch or browsing movies.",
  "frontend/src/components/HowItWorksSection.tsx": "Informational section displaying a three-step onboarding process (sign up, choose plan, start streaming) and benefits cards highlighting affordable pricing, data saver mode, and creator support.",
  "frontend/src/components/InAppEventsSection.tsx": "Interactive events feature with tabs for upcoming/live events, event cards for Q&As, festivals, listening parties, workshops, premieres, and competitions, plus dialogs for creating and joining events with chat functionality.",
  "frontend/src/components/InstallPromptBanner.tsx": "Fixed-position banner prompting users to install the PWA, with platform-specific instructions for iOS and a direct install button for other platforms using the install prompt hook.",
  "frontend/src/components/InstantPayoutsSection.tsx": "Marketing section showcasing payment options for creators, featuring cards for instant crypto payouts (ICP, BTC, ETH, USDC) and local fiat options (mobile money, M-Pesa, bank transfers).",
  "frontend/src/components/InstantWithdrawalSection.tsx": "Component for instant cryptocurrency withdrawals, allowing users to withdraw earnings to ICP, USDT, or USDC wallets with balance display, currency selection, and validation for minimum withdrawal amounts.",
  "frontend/src/components/InteractiveLearningGames.tsx": "Interactive quiz game component featuring multiple categories (geography, culture, wildlife) with questions about Africa, tracking game progress, scores, and providing explanations for correct answers.",
  "frontend/src/components/InteractiveTrivia.tsx": "Timed trivia game component focused on African cinema and Nollywood, featuring questions with difficulty levels, countdown timers, score multipliers, streak tracking, and participant management for multiplayer support.",
  "frontend/src/components/KidsZoneSection.tsx": "Kids content section with age-appropriate African cultural and educational content, including movies, music, games, achievements tracking, and parental controls for watch time and content filtering.",
  "frontend/src/components/Leaderboards.tsx": "Leaderboard display component showing rankings across multiple categories (top reviewers, active users, watch party hosts, trivia champions) with badges, scores, and rank change indicators.",
  "frontend/src/components/LiveMatchPreview.tsx": "Displays live and upcoming African sports match previews with countdown timers, match details, and notification options. Includes loading skeletons and empty states.",
  "frontend/src/components/LivePolls.tsx": "Interactive live polling component for movie premieres with real-time voting, countdown timers, participant tracking, and multiple poll types (prediction, opinion, trivia, reaction).",
  "frontend/src/components/LivePremiereEvents.tsx": "Manages live premiere events for movies, music, and documentaries with features like RSVP, live chat, Q&A sessions, and polls. Includes event listing, detail dialogs, and real-time interaction.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading component with animated TamriStream branding, progress bar, and customizable loading messages. Simulates progress if not provided.",
  "frontend/src/components/LocalFilmHubsSection.tsx": "Showcases regional film hubs partnering with African universities and media houses, displaying hub details, equipment access, member counts, and partnership information with an interactive map.",
  "frontend/src/components/LoginScreen.tsx": "Main landing page with Internet Identity authentication, featuring hero banners, creator empowerment sections, payment models, business sections, and various informational components about the platform.",
  "frontend/src/components/MerchandiseStore.tsx": "Merchandise store component with tabs for browsing items, managing cart, viewing orders, and creating new merchandise. Includes mock data for physical/digital products with categories, pricing, inventory, and creator information.",
  "frontend/src/components/MessagingCenter.tsx": "Messaging interface component displaying conversations list and message threads. Allows users to search conversations, view online status, and send messages to creators and other users.",
  "frontend/src/components/MovieCard.tsx": "Movie card component displaying poster, title, description, rating, and review count with hover effects. Includes buttons for watching and viewing blockchain transparency information.",
  "frontend/src/components/MovieCatalog.tsx": "Main movie catalog page with hero banner, featured slider, AI discovery, transparent ranking, genres section, and search functionality. Conditionally renders sections based on search state and handles movie selection.",
  "frontend/src/components/MovieDialog.tsx": "Movie detail dialog with tabs for overview, ratings/reviews, extras content, and admin upload section. Integrates video playback with quality selection, data usage tracking, favorites, and watch party creation.",
  "frontend/src/components/MovieNightCalendar.tsx": "Movie night scheduling component allowing users to create and view scheduled watch parties with date/time, invitees, and movie selection. Displays upcoming, active, and completed events with status badges.",
  "frontend/src/components/MovieTransparencyPage.tsx": "Displays blockchain-verified transparency data for a movie including views, earnings, revenue breakdown, and viewer countries. Integrates with smart royalty contracts and provides links to Internet Computer blockchain explorer.",
  "frontend/src/components/MultiLanguageSubtitles.tsx": "Provides AI-powered multi-language subtitle and audio track selection with support for 10 languages including African languages (Swahili, Yoruba, Hausa, Amharic, Zulu). Includes subtitle size adjustment, auto-translate toggle, and cultural context preservation options.",
  "frontend/src/components/MusicStreamingSection.tsx": "Full-featured music streaming interface with audio playback controls, playlist management, artist profiles, search, and categorization by genre (Afrobeats, Highlife, Amapiano, Gospel). Includes queue management, shuffle, repeat modes, and volume controls.",
  "frontend/src/components/MusicVideosSection.tsx": "Music video browsing and playback component with search, genre filtering, playlist creation, and featured playlists. Supports adding videos to playlists and displays categorized content by African music genres.",
  "frontend/src/components/OfflineIndicator.tsx": "Displays a badge indicator when the user is offline, showing cached content availability and last online timestamp using a tooltip.",
  "frontend/src/components/OnChainPaymentsSection.tsx": "Marketing section explaining blockchain-based payment transparency features including blockchain verification, real-time earnings tracking, and security benefits built on Internet Computer.",
  "frontend/src/components/OptimizedImage.tsx": "Reusable image component with automatic webp conversion, responsive srcsets, lazy loading, loading skeletons, and error handling. Supports multiple aspect ratios (video, square, portrait).",
  "frontend/src/components/OwnershipTrackingSection.tsx": "Marketing section component that displays blockchain-based ownership tracking features, including NFT certificates, usage analytics, and revenue tracking with visual cards and badges.",
  "frontend/src/components/PartnershipApplicationForm.tsx": "Form component for creators to apply to the First 100 Partnership Program, handling application submission and displaying application status (Pending/Approved/Rejected) with appropriate UI feedback.",
  "frontend/src/components/PartnershipOfferSection.tsx": "Marketing section displaying active partnership offers with progress tracking, showing remaining slots and percentage filled for the First 100 African Creators program.",
  "frontend/src/components/PaymentOptions.tsx": "Informational component with tabs displaying supported payment methods for users (crypto, stablecoins, traditional gateways) and withdrawal options for creators.",
  "frontend/src/components/PersonalizedRecommendations.tsx": "Recommendation engine component that generates personalized movie and music suggestions based on user favorites and playlists, with feedback mechanism and tabbed interface.",
  "frontend/src/components/PodcastsRadioSection.tsx": "Displays podcasts and radio stations with audio playback controls, search, tabs, and player features including volume, speed adjustment, and error handling using a ref-based audio element.",
  "frontend/src/components/PrivacyPolicy.tsx": "Renders a static privacy policy page with sections on data collection, usage, security, and compliance, styled with icons and a gradient background.",
  "frontend/src/components/ProductionReadinessCheck.tsx": "Admin-only dashboard that displays production readiness checks (security, compliance, performance) and allows initialization of partnership offers with status indicators and progress tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name and create a user profile with empty favorite movies and watch party history using the useSaveCallerUserProfile hook.",
  "frontend/src/components/RevenueModelDisplay.tsx": "Displays TamriStream's revenue-sharing model across five streams (subscriptions, ads, pay-per-view, tips, merchandise) with creator/platform split percentages fetched from useGetRevenueModel hook.",
  "frontend/src/components/ReviewerDashboard.tsx": "Admin dashboard for reviewing filmmaker submissions with tabs for pending, approved, and rejected content, displaying counts and action buttons for each submission.",
  "frontend/src/components/SmartRoyaltiesDashboard.tsx": "Dashboard component displaying creator's smart royalty earnings, content statistics, royalty events, and payout history with blockchain-based tracking and ICP token formatting.",
  "frontend/src/components/SmartRoyaltiesSection.tsx": "Marketing/informational section explaining the smart royalties system features including unique canister IDs, event logging, auto distribution, and transparent tracking with visual infographic.",
  "frontend/src/components/SmartTVInterface.tsx": "Smart TV optimized interface component with remote control navigation, large-screen UI, and featured content display for living room viewing experience.",
  "frontend/src/components/SocialSharingSection.tsx": "Social sharing component with community feed, multi-platform sharing (Facebook, Twitter, Instagram, WhatsApp), privacy settings, and content engagement tracking (likes, comments, shares).",
  "frontend/src/components/SportsContentCard.tsx": "Card component for displaying sports content with thumbnail, title, description, access tier badges, ratings, and event information with hover effects.",
  "frontend/src/components/SportsCreatorDashboard.tsx": "Dashboard for sports content creators to submit content, manage submissions, view revenue share, and configure payment methods (mobile money, M-Pesa, crypto).",
  "frontend/src/components/SportsSection.tsx": "Displays sports content with search, filtering by sport type, live matches preview, and featured sliders. Includes loading states, error handling, and debounced search functionality.",
  "frontend/src/components/SystemHealthMonitor.tsx": "Monitors backend connection health with periodic checks, auto-retry logic, and displays alerts for offline or degraded service states. Shows connection status notifications in bottom-right corner.",
  "frontend/src/components/TamriGrantsPortal.tsx": "DAO-governed grants portal for submitting and voting on eco-friendly, cultural, and educational project proposals. Displays active grants with funding progress, votes, and impact scores.",
  "frontend/src/components/TamriIntelligenceHub.tsx": "Unified AI-powered platform hub showing intelligence metrics, content insights, recommendations, and navigation to specialized modules (Neural Studio, Knowledge Graph, Tokenized Ecosystem, Grants Portal).",
  "frontend/src/components/TamriOriginalsSection.tsx": "Showcases community-funded African original content projects with DAO voting, funding progress tracking, and revenue sharing features. Displays project cards with funding goals, backers, and status.",
  "frontend/src/components/TechnicalDocumentation.tsx": "React component displaying comprehensive technical documentation for TamriStream, including tabbed sections for architecture overview, frontend, backend, storage, payments, and analytics with detailed technology stack information.",
  "frontend/src/components/TermsOfService.tsx": "Static React component rendering the Terms of Service page with sections covering agreement terms, use license, user accounts, subscriptions/payments, and legal policies.",
  "frontend/src/components/TopPicksSection.tsx": "React component displaying curated top movie picks with cards showing movie details, curator recommendations, ratings, and loading skeletons; handles movie selection callbacks.",
  "frontend/src/components/TopPicksSectionWrapper.tsx": "Wrapper component that fetches top picks data, manages movie selection state, and integrates TopPicksSection with MovieDialog and navigation to watch parties.",
  "frontend/src/components/TrailersSection.tsx": "React component displaying movie trailers organized by categories (Latest, Popular, Coming Soon) with hover effects, play buttons, and a dialog for trailer playback.",
  "frontend/src/components/TransparentRanking.tsx": "React component explaining the platform's transparent ranking algorithm, displaying weighted ranking factors (view count, engagement, quality, etc.) with progress bars and expandable detailed explanations.",
  "frontend/src/components/TriviaGame.tsx": "Interactive trivia game component about African cinema with 8 questions, timer, scoring, and progress tracking. Includes difficulty levels, categories, and game state management.",
  "frontend/src/components/UnlockableContentSection.tsx": "Displays unlockable premium content (movies, music, interviews, behind-scenes) with progress tracking toward unlock criteria like badges, streaks, challenges, and staking. Includes rarity tiers and estimated values.",
  "frontend/src/components/UploadMovieForm.tsx": "Form component for uploading movies with title, description, poster, and trailer files. Handles file uploads with progress tracking and integrates with backend mutations.",
  "frontend/src/components/UserGeneratedPlaylistsSection.tsx": "Manages user-created playlists for movies and music with features for discovery, creation, following, liking, and filtering. Includes playlist items, tags, and social engagement metrics.",
  "frontend/src/components/UserProfile.tsx": "User profile dashboard displaying favorites, watch party history, and quick access cards to audience rewards, AI personalization, and engagement features. Includes data usage and bandwidth settings.",
  "frontend/src/components/VideoQualitySelector.tsx": "A popover component that allows users to select video quality (240p-1080p) with auto-quality mode, displays bandwidth information, and includes a low-bandwidth mode toggle.",
  "frontend/src/components/VideoReviewsSection.tsx": "Displays a grid of video reviews with thumbnails, user avatars, ratings, and interaction buttons (like, comment, share) for community-generated movie reviews.",
  "frontend/src/components/VirtualFilmFestival.tsx": "A tabbed interface for virtual film festival events showing upcoming premieres, Q&A sessions, and documentaries with RSVP functionality and event details.",
  "frontend/src/components/VoiceSearchInterface.tsx": "Provides voice-activated search functionality with a microphone button, transcript display, and mock search results for movies, music, and sports content.",
  "frontend/src/components/WatchPartyView.tsx": "A synchronized watch party component with video playback controls, real-time chat, enhanced reaction system (love, laugh, fire, etc.), and reaction feed animations.",
  "frontend/src/components/WatchPartyViewWrapper.tsx": "A router wrapper component that extracts the partyId from URL params and passes it to WatchPartyView with navigation handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAdaptiveStreaming.ts": "Manages adaptive video streaming quality based on bandwidth, low-bandwidth mode, and buffer health with automatic quality transitions and manual override options.",
  "frontend/src/hooks/useBackendHealthStatus.ts": "Polls backend health status every 30 seconds using a lightweight query, returning Healthy, Degraded, or Offline states.",
  "frontend/src/hooks/useBandwidthMonitor.ts": "Monitors network connection type and bandwidth using the Network Information API, recommending appropriate video quality levels (240p-1080p) based on connection speed and data saver mode.",
  "frontend/src/hooks/useBandwidthSettings.ts": "Persists user bandwidth preferences to localStorage including default quality for WiFi/cellular, autoplay settings, and data saver mode.",
  "frontend/src/hooks/useConnectionSpeedTest.ts": "Runs a network speed test by fetching assets and measuring download speed, upload speed (estimated), and latency.",
  "frontend/src/hooks/useDataUsageTracker.ts": "Tracks video streaming data usage by quality level with daily/weekly/monthly counters, persisting session history to localStorage and auto-resetting based on time periods.",
  "frontend/src/hooks/useInstallPrompt.ts": "Manages PWA installation prompts, detecting installability, handling beforeinstallprompt events, and tracking install/dismiss state with special iOS detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and AuthClient integration for ICP authentication.",
  "frontend/src/hooks/useLowBandwidthMode.ts": "Manages low bandwidth mode toggle and quality override settings, persisting preferences to localStorage.",
  "frontend/src/hooks/useOfflineStatus.ts": "Monitors online/offline status using navigator.onLine and checks for cached content availability via the Cache API.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for data fetching and mutations, including admin checks, movie/music/sports content queries, and mock types for features not yet implemented in the backend. Includes extensive type definitions for various content types (movies, music tracks, playlists, sports content, etc.).",
  "frontend/src/hooks/useRecentRuntimeErrors.ts": "Custom React hook that captures and tracks runtime errors and unhandled promise rejections, storing up to 20 recent errors with timestamps and stack traces. Provides error clearing functionality.",
  "frontend/src/hooks/useServiceWorkerDiagnostics.ts": "React hook for monitoring service worker status and providing diagnostic information including registration state, update availability, and cache management. Includes utilities to check for updates, reload, and clear caches.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for theming (dark mode), utility classes for animations and responsive text, custom scrollbar styling, and performance optimizations including GPU acceleration and lazy loading styles.",
  "frontend/src/lib/imageOptimization.ts": "Image optimization utilities providing responsive srcset generation with WebP conversion, multiple size variants (400/800/1200px), lazy loading helpers, image preloading for LCP optimization, and client-side WebP conversion for uploads.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication, then renders the main App component.",
  "frontend/src/sw/registerServiceWorker.ts": "Service worker registration utility with versioned cache-busting, automatic update checking, and page reload on controller change. Only registers in production builds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color palette with CSS variables, container settings, custom shadows, animations (accordion, wave), and plugins for typography and container queries.",
  "project_state.json": "Project state file for TamriStream, an African streaming platform with on-chain royalties and mobile-first design. Tracks implemented features including low-bandwidth mode, data usage indicators, PWA capabilities, adaptive streaming, and mobile-optimized settings.",
  "unknown.txt": "Deployment checklist and rollback procedures for production deployment. Includes verification steps, post-deployment monitoring tasks, support contacts, and production URLs."
}