{
  "backend/main.mo": "Main Motoko actor for TamriStream with comprehensive state management for 40+ features including movies, user profiles, ratings, creator submissions, watch parties, music videos, playlists, sports content, kids zone, podcasts, and radio stations, plus integrated access control, blob storage, Stripe payments, and invite links modules.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence mobile optimization features: fixing critical JavaScript errors, verifying touch event handlers, fixing viewport rendering issues, and testing service worker caching strategy, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx with 75+ feature routes and PWA support, mobile-optimized Header and MovieDialog, enhanced LoginScreen with creator showcase, React Query hooks with error handling, and global CSS with iOS/Android mobile fixes.",
  "frontend/DEPLOYMENT.md": "Production deployment guide with pre-deployment checklist covering environment configuration, security, GDPR compliance, performance optimization, testing, and monitoring, plus deployment steps starting with frontend build.",
  "frontend/index.html": "Main HTML entry point with critical mobile viewport configuration, PWA meta tags, early error detection script, preconnect optimization, and noscript fallback for JavaScript-disabled browsers.",
  "frontend/public/manifest.json": "PWA manifest defining TamriStream as a standalone app with African entertainment description, amber theme color, app icons at 192x192 and 512x512 sizes, and entertainment/video/music categories.",
  "frontend/public/sw.js": "Service worker implementing versioned caching with network-first strategy for HTML, cache-first for assets, graceful error handling, automatic old cache cleanup on activation, and offline fallback page with retry functionality.",
  "frontend/src/App.tsx": "Main application entry point that sets up routing with TanStack Router, React Query, theme provider, and defines routes for all major application sections including movie catalog, user profiles, creator portals, payment options, and various feature sections.",
  "frontend/src/components/AdminApprovalDashboard.tsx": "Admin interface for reviewing and approving creator content submissions with tabs for pending, approved, and rejected content, including feedback functionality and approval statistics.",
  "frontend/src/components/AdminPartnershipDashboard.tsx": "Admin dashboard for managing the First 100 African Creators partnership program, displaying application statistics, pending/approved/rejected applications, and providing approve/reject functionality with slot limit enforcement.",
  "frontend/src/components/AdvancedAnalyticsDashboard.tsx": "Comprehensive analytics dashboard displaying content performance metrics, revenue breakdowns, audience demographics, engagement rates, and top-performing content with filtering by time period and content type.",
  "frontend/src/components/AIContentModeration.tsx": "Admin dashboard component for AI-powered content moderation that displays flagged content with severity levels, confidence scores, and provides approve/reject actions with moderation statistics.",
  "frontend/src/components/AIIndieDiscovery.tsx": "Component that uses AI to discover and showcase hidden gem indie films based on review patterns and quality metrics, with tooltips explaining the discovery algorithm and displaying filtered movie cards.",
  "frontend/src/components/AIPersonalizationDashboard.tsx": "Tabbed dashboard component that combines AI-powered indie discovery, multi-language subtitle features, and transparent ranking system into a unified personalization interface.",
  "frontend/src/components/ArtistDashboard.tsx": "Artist management interface for creating profiles, uploading music tracks with audio and cover art, managing revenue shares, and viewing track performance with file upload progress tracking.",
  "frontend/src/components/AudienceRewardsSection.tsx": "Gamified rewards system for viewers featuring token balance display, engagement activities (watch, rate, review, share), missions with progress tracking, referral link generation, and NFT collectibles management.",
  "frontend/src/components/BandwidthSettingsPanel.tsx": "User settings panel for configuring video quality preferences and autoplay behavior separately for WiFi and cellular connections, with connection speed testing integration.",
  "frontend/src/components/BulkUploadForm.tsx": "React component for bulk uploading multiple movies with drag-and-drop support, file management (posters/trailers), progress tracking, and integration with upload mutation hooks.",
  "frontend/src/components/BusinessModelSection.tsx": "Displays TamriStream's business model and pricing structure including subscription tiers, partnership benefits, and flexible payment options with a hero section and visual infographic.",
  "frontend/src/components/ComingSoonSection.tsx": "Shows upcoming movie releases with countdown timers, notification toggles, and movie details including thumbnails, genres, directors, and release dates.",
  "frontend/src/components/CommunityPlaylistsSection.tsx": "Manages community-created music video playlists with search/filter functionality, follow/like actions, and displays playlist metadata including creator info, follower counts, and featured status.",
  "frontend/src/components/CommunityStakingSection.tsx": "Implements token staking functionality for movies and artists, showing staking pools with APY rates, rewards, user balances, and stake management with duration selection.",
  "frontend/src/components/CommunityVoting.tsx": "Community voting component that displays active and closed polls for movie selections, allowing users to vote on featured movies and view real-time voting results with progress bars and percentages.",
  "frontend/src/components/ConnectionSpeedTest.tsx": "Connection speed test component that measures download/upload speeds and latency, providing quality recommendations (240p to 1080p) based on test results using a custom hook.",
  "frontend/src/components/CreatorAcademy.tsx": "Full-page Creator Academy interface displaying courses with progress tracking, achievements, instructor details, and course completion functionality for filmmaking, music production, and business content.",
  "frontend/src/components/CreatorAcademySection.tsx": "Landing section for Creator Academy showcasing featured courses, platform statistics (students, certifications, success rate), and highlighting free training for African youth in filmmaking and blockchain.",
  "frontend/src/components/CreatorDAOInterface.tsx": "DAO governance interface for creators to view and vote on platform proposals (revenue share, content moderation, features), submit new proposals, and track voting power and governance statistics.",
  "frontend/src/components/CreatorDashboard.tsx": "Creator dashboard component displaying revenue share data, payment method configuration (ICP, USDT, USDC, wallets, mobile money, etc.), earnings statistics, payout history table, and payment method management with toast notifications.",
  "frontend/src/components/CreatorFirstHero.tsx": "Hero section component promoting TamriStream's creator-first platform with emphasis on 70-90% revenue share, on-chain transparency, instant payouts, and flexible payment options; includes call-to-action buttons and feature highlights.",
  "frontend/src/components/CreatorFollowingSection.tsx": "Component for managing creator following/followers with tabs for discovery, following list, and notifications; displays mock creator profiles with stats, specialties, and recent work, plus notification feed for creator updates.",
  "frontend/src/components/CreatorNeuralStudio.tsx": "AI-powered content analysis tool that simulates analyzing uploaded video/audio files and provides mock insights on pacing, engagement predictions, quality metrics, and optimization recommendations with progress tracking.",
  "frontend/src/components/CreatorOnboardingProgram.tsx": "Creator learning program interface displaying onboarding modules (Getting Started, Content Guidelines, Upload & Distribution, Revenue & Analytics) with completion tracking, progress bar, and module cards showing duration and status.",
  "frontend/src/components/CreatorPortal.tsx": "Creator submission portal with form for filmmakers to submit content, displays revenue model information, verification status, and includes tabs for submission, verification, and future add-ons with blockchain transparency messaging.",
  "frontend/src/components/CreatorSpotlightSection.tsx": "Displays featured African creators (filmmakers and musicians) with profiles, achievements, recent work, follower counts, and follow/unfollow functionality organized in filterable tabs.",
  "frontend/src/components/CreatorVerificationForm.tsx": "Form for creators to submit verification requests with identity documents and contact info, displays verification status (pending/approved/rejected) with submission and verification dates.",
  "frontend/src/components/CulturalKnowledgeGraph.tsx": "Semantic AI visualization showing connections between African creators, cultural influences, genres, and regions with collaboration suggestions based on compatibility scores.",
  "frontend/src/components/DailyChallenges.tsx": "Gamification component displaying daily challenges (watch, social, engage, discover categories) with progress tracking, points rewards, and completion status.",
  "frontend/src/components/DataUsageEstimator.tsx": "Displays estimated data consumption for different video quality levels (240p-1080p) based on playback duration, with bandwidth-based quality recommendations.",
  "frontend/src/components/DataUsageIndicator.tsx": "Displays a badge showing current session data usage in MB with color-coded indicators (green/yellow/red) based on consumption levels. Tracks usage every 10 seconds during playback based on quality level.",
  "frontend/src/components/DataUsageSettings.tsx": "Provides a settings panel for viewing data usage statistics (daily, weekly, monthly) with progress bars against predefined limits. Includes functionality to reset statistics and displays average usage per session.",
  "frontend/src/components/DiagnosticsPage.tsx": "System diagnostics dashboard displaying build information, backend health status, service worker status, and runtime errors. Provides controls for checking updates, clearing cache, and managing service worker state.",
  "frontend/src/components/DynamicTokenizedEcosystem.tsx": "Comprehensive tokenized economy interface showing wallet balances, creator tokens, NFT badges, staking pools, and reward tiers. Includes functionality for tipping creators and staking tokens with mock data for demonstration.",
  "frontend/src/components/EnhancedCreatorDashboard.tsx": "Creator analytics dashboard displaying real-time streaming metrics, earnings, viewer geography, and content approval status. Shows approved and pending content with on-chain verification of royalties and performance data.",
  "frontend/src/components/EnhancedErrorDisplay.tsx": "Error display component that categorizes errors (network, auth, permission, validation) and shows contextual messages with suggestions. Provides retry and home navigation buttons with detailed error information.",
  "frontend/src/components/EnhancedMovieUploadForm.tsx": "Form component for uploading movies with metadata, video/poster files, contributor management with revenue split validation, and integration with creator verification and content approval hooks.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and categorizes errors (network, auth, module, render), logs them to localStorage, and provides recovery options including cache clearing and page reload.",
  "frontend/src/components/FanClubsSection.tsx": "Displays fan clubs with tiered memberships (bronze/silver/gold/platinum), showing creator info, member counts, benefits, and monthly fees with join/leave functionality.",
  "frontend/src/components/FanRewardsSection.tsx": "Gamification component managing user points, tier progression, and redeemable rewards across categories (content, events, merchandise, experiences) with rarity levels and activity tracking.",
  "frontend/src/components/FeaturedMovieSlider.tsx": "Auto-playing carousel slider for featured movies with navigation controls, displaying movie posters, descriptions, ratings, and action buttons for watching trailers or selecting movies.",
  "frontend/src/components/FeaturedSportsSlider.tsx": "A carousel component that displays featured sports content with auto-play functionality, navigation controls, and displays metadata like access tier, sport type, and ratings with gradient overlays.",
  "frontend/src/components/FilmmakerUploadSection.tsx": "A form component for filmmakers to submit their films for review, collecting details like title, director, description, cast, and rights verification with validation and toast notifications.",
  "frontend/src/components/Footer.tsx": "A footer component with navigation links organized into Company, Content, and Creators sections, plus social media icons and trust indicators like privacy policy and terms of service.",
  "frontend/src/components/FutureAddOnsSection.tsx": "Displays upcoming platform features (NFT ownership, referral system, community DAO, mobile money integration) with descriptions, benefits, release dates, and notification signup functionality.",
  "frontend/src/components/GDPRConsentBanner.tsx": "A fixed bottom banner that displays GDPR cookie consent notice with accept/decline buttons, storing user preferences in localStorage and linking to privacy policy.",
  "frontend/src/components/GenresSection.tsx": "A grid display of movie genres (Drama, Comedy, Action, Romance, Thriller, Family) with icons, gradient colors, and hover effects for genre exploration.",
  "frontend/src/components/GeoTargetedContent.tsx": "Displays region-specific content discovery interface with region selector, trending content by location, and filtered movie/music recommendations for different African regions.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile menus, authentication controls via Internet Identity, admin dropdown, and offline indicator.",
  "frontend/src/components/HeroBanner.tsx": "Landing page hero section with background image, headline text about African cinema streaming, and dual CTA buttons for starting to watch or browsing movies.",
  "frontend/src/components/HowItWorksSection.tsx": "Explains the platform onboarding process in three steps (sign up, choose plan, start streaming) and highlights key benefits like affordable pricing, data saver mode, and creator support.",
  "frontend/src/components/InAppEventsSection.tsx": "Manages virtual events like Q&As, film festivals, listening parties, and premieres with event listings, participant management, live chat, and event creation dialogs.",
  "frontend/src/components/InstallPromptBanner.tsx": "Fixed banner prompting users to install the PWA with platform-specific instructions for iOS and a direct install button for other platforms.",
  "frontend/src/components/InstantPayoutsSection.tsx": "Marketing section component showcasing instant payout features with crypto (ICP, BTC, ETH, USDC) and fiat (mobile money, M-Pesa, bank transfers) options. Displays payment method cards with icons, badges, and navigation to payout setup.",
  "frontend/src/components/InstantWithdrawalSection.tsx": "Functional withdrawal interface allowing users to withdraw earnings to crypto wallets (ICP, USDT, USDC). Includes balance display, withdrawal form with validation, minimum withdrawal checks, and demo mode alert.",
  "frontend/src/components/InteractiveLearningGames.tsx": "Educational quiz game component featuring multiple categories (geography, culture, wildlife) with questions about Africa. Manages game state, tracks progress/scores, displays questions with multiple-choice answers and explanations.",
  "frontend/src/components/InteractiveTrivia.tsx": "Trivia game component focused on African cinema and Nollywood knowledge with timed questions, difficulty levels, scoring system with multipliers/streaks, and multiplayer participant tracking. Includes explanations and varied time limits per question.",
  "frontend/src/components/KidsZoneSection.tsx": "Kids content section with age-grouped educational content (movies, music, games) featuring African themes, parental controls, watch time tracking, and achievement system. Displays content cards with educational value tags and filtering options.",
  "frontend/src/components/Leaderboards.tsx": "Displays tabbed leaderboards for top reviewers, most active users, watch party hosts, and trivia champions with rank icons, badges, and change indicators.",
  "frontend/src/components/LiveMatchPreview.tsx": "Shows live sports match previews with countdown timers, match details, and real-time updates for upcoming African sports events.",
  "frontend/src/components/LivePolls.tsx": "Interactive live polling component for movie premieres with real-time voting, countdown timers, and participant tracking for predictions, opinions, and reactions.",
  "frontend/src/components/LivePremiereEvents.tsx": "Manages live premiere events for movies, music, and documentaries with RSVP, chat, Q&A, and special guest features.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading component with animated TamriStream branding, progress bar, and customizable loading messages.",
  "frontend/src/components/LocalFilmHubsSection.tsx": "Showcases regional film hubs partnered with African universities and media houses, displaying equipment access, member counts, and partnership information.",
  "frontend/src/components/LoginScreen.tsx": "Landing page component that displays marketing sections (hero banner, creator empowerment, payment features, business model, etc.) and handles Internet Identity authentication with login/logout functionality.",
  "frontend/src/components/MerchandiseStore.tsx": "E-commerce component for browsing and purchasing creator merchandise (apparel, accessories, digital items, collectibles) with cart management, order tracking, and creator store creation features.",
  "frontend/src/components/MessagingCenter.tsx": "Messaging interface component that displays conversations between users and creators, with message history, online status indicators, and message sending functionality.",
  "frontend/src/components/MovieCard.tsx": "Reusable movie card component that displays movie poster, title, description, rating, and action buttons for watching or viewing blockchain transparency details.",
  "frontend/src/components/MovieCatalog.tsx": "Main movie browsing component that orchestrates search, featured movies carousel, AI discovery, transparent ranking, genre sections, and handles movie selection with debounced search.",
  "frontend/src/components/MovieDialog.tsx": "Modal dialog for movie details with video playback, rating/review submission, favorites management, admin upload controls, extras content, watch party creation, and adaptive streaming with data usage tracking.",
  "frontend/src/components/MovieNightCalendar.tsx": "React component for scheduling and managing movie watch parties with invitees, dates, times, and status tracking. Includes a dialog for creating new movie nights and displays them in list or calendar view.",
  "frontend/src/components/MovieTransparencyPage.tsx": "Displays blockchain-verified transparency data for a specific movie including views, earnings, revenue breakdown, and viewer demographics. Integrates with smart royalty contracts and provides links to blockchain explorer.",
  "frontend/src/components/MultiLanguageSubtitles.tsx": "UI component for managing multi-language subtitle and audio settings with AI-powered translation support. Includes controls for language selection, subtitle size, auto-translate, and cultural context display across 10+ languages.",
  "frontend/src/components/MusicStreamingSection.tsx": "Full-featured music streaming interface with audio playback controls, playlist management, search, categorization by genre, and artist profiles. Includes player controls for shuffle, repeat, volume, and queue management.",
  "frontend/src/components/MusicVideosSection.tsx": "Music video browsing and playback component with search, genre filtering, playlist creation, and featured collections. Displays videos in a grid with dialog-based video player.",
  "frontend/src/components/OfflineIndicator.tsx": "Status badge component that displays offline state with tooltip showing cached content availability and last online timestamp. Hidden when user is online.",
  "frontend/src/components/OnChainPaymentsSection.tsx": "Marketing section component that highlights blockchain-based payment transparency features, including verified transactions, real-time tracking, and security benefits on the Internet Computer blockchain.",
  "frontend/src/components/OptimizedImage.tsx": "Reusable image component with WebP optimization, responsive srcsets, lazy loading, skeleton loading states, and configurable aspect ratios for better performance and UX.",
  "frontend/src/components/OwnershipTrackingSection.tsx": "Marketing section showcasing blockchain-verified content ownership features, including NFT certificates, usage analytics, and rights tracking with visual dashboard preview.",
  "frontend/src/components/PartnershipApplicationForm.tsx": "Form component for creators to apply to the First 100 Partnership Program, displaying application status (pending/approved/rejected) and handling submission with real-time slot availability tracking.",
  "frontend/src/components/PartnershipOfferSection.tsx": "Marketing section displaying the limited-time First 100 African Creators partnership offer with progress bar, remaining slots counter, and call-to-action to apply.",
  "frontend/src/components/PaymentOptions.tsx": "Informational component with tabbed interface explaining payment methods for users (crypto, stablecoins, traditional) and withdrawal options for creators across Africa.",
  "frontend/src/components/PersonalizedRecommendations.tsx": "React component that generates and displays personalized movie and music recommendations based on user favorites and listening history, with feedback mechanisms (thumbs up/down) and confidence scores.",
  "frontend/src/components/PodcastsRadioSection.tsx": "React component providing podcast episodes and live radio station streaming with audio playback controls, search functionality, volume/speed adjustments, and error handling for audio streams.",
  "frontend/src/components/PrivacyPolicy.tsx": "Static React component displaying TamriStream's privacy policy with sections on data collection, usage, security measures, and GDPR compliance for the African entertainment streaming platform.",
  "frontend/src/components/ProductionReadinessCheck.tsx": "Admin-only React component that performs production readiness checks across security, compliance, and infrastructure categories, and allows initialization of partnership offers for creators.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for first-time user profile creation, collecting user name and initializing a UserProfile with empty lists for favorites and watch party history.",
  "frontend/src/components/RevenueModelDisplay.tsx": "React component that visualizes TamriStream's revenue-sharing model across five streams (subscriptions, ads, pay-per-view, tips, merchandise), showing creator vs platform fee splits with icons and descriptions.",
  "frontend/src/components/ReviewerDashboard.tsx": "Dashboard component for film reviewers to view and manage filmmaker submissions with tabs for pending, approved, and rejected content. Displays submission statistics and provides review/approve/reject actions for each submission.",
  "frontend/src/components/SmartRoyaltiesDashboard.tsx": "Comprehensive dashboard for creators to track blockchain-based royalty earnings, view payment events, and monitor payout history. Shows total earnings, active content count, and detailed transaction logs with canister IDs.",
  "frontend/src/components/SmartRoyaltiesSection.tsx": "Marketing/informational section explaining the smart royalties system with feature cards highlighting unique canister IDs, event logging, auto distribution, and blockchain verification. Includes infographic display and feature grid.",
  "frontend/src/components/SmartTVInterface.tsx": "Smart TV optimized interface component with remote control navigation simulation and large-screen UI for living room viewing. Features content carousel with directional navigation and TV-style layout.",
  "frontend/src/components/SocialSharingSection.tsx": "Social media integration component with community feed, sharing to multiple platforms (Facebook, Twitter, Instagram, WhatsApp), and privacy settings. Displays shared content with likes, comments, and shares metrics.",
  "frontend/src/components/SportsContentCard.tsx": "Reusable card component for displaying sports content with thumbnail, title, description, ratings, access tier badges, and sport type. Includes hover effects and optimized image loading.",
  "frontend/src/components/SportsCreatorDashboard.tsx": "Dashboard component for sports content creators to submit content, track submissions, view revenue share, and manage payment methods (mobile money, M-Pesa, crypto). Includes form handling, status tracking, and payment method configuration.",
  "frontend/src/components/SportsSection.tsx": "Main sports content browsing component with search, filtering by sport category, live match previews, and featured sports slider. Displays sports content cards with debounced search and loading/error states.",
  "frontend/src/components/SystemHealthMonitor.tsx": "Health monitoring component that periodically checks backend connectivity, displays connection status alerts, and provides auto-retry functionality with exponential backoff for offline/degraded states.",
  "frontend/src/components/TamriGrantsPortal.tsx": "DAO-governed grants portal for community-funded projects (eco-friendly, cultural, educational). Features grant proposals, voting, funding progress tracking, and impact scoring with mock data.",
  "frontend/src/components/TamriIntelligenceHub.tsx": "Unified AI-powered intelligence hub displaying insights, recommendations, and navigation to specialized modules (Neural Studio, Knowledge Graph, Tokenized Ecosystem, Grants Portal) with analytics metrics and actionable suggestions.",
  "frontend/src/components/TamriOriginalsSection.tsx": "Displays community-funded African original series and films with DAO voting, funding progress, and revenue sharing features. Shows project cards with funding goals, backers, and status badges.",
  "frontend/src/components/TechnicalDocumentation.tsx": "Technical architecture documentation component with tabbed interface covering overview, frontend, backend, storage, payments, and analytics. Details the Internet Computer Protocol implementation with React and Motoko smart contracts.",
  "frontend/src/components/TermsOfService.tsx": "Static terms of service page displaying legal agreements, use licenses, user account requirements, subscription/payment terms, and platform policies with icon-decorated sections.",
  "frontend/src/components/TopPicksSection.tsx": "Displays curated top movie picks with curator recommendations, ratings, and review counts. Each card shows movie cover, curator name, and recommendation text with click-to-view functionality.",
  "frontend/src/components/TopPicksSectionWrapper.tsx": "Wrapper component that fetches top picks data and manages movie selection state, integrating TopPicksSection with MovieDialog and navigation to watch parties.",
  "frontend/src/components/TrailersSection.tsx": "Displays movie trailers organized by categories (Latest, Popular, Coming Soon) with play buttons and ratings. Opens trailer dialog on click with mock trailer data.",
  "frontend/src/components/TransparentRanking.tsx": "Displays a transparent ranking system component that shows how content is ranked using weighted factors (view count, engagement, quality score, creator activity, recency) with visual progress bars and expandable explanations. Includes an accordion section for detailed methodology and emphasizes bias-free, open-source algorithm transparency.",
  "frontend/src/components/TriviaGame.tsx": "Implements an interactive trivia game about African cinema with timed questions, score tracking, and multiple difficulty levels. Features 8 sample questions covering topics like Nollywood, FESPACO, and African film industries with a 30-second timer per question and progress tracking.",
  "frontend/src/components/UnlockableContentSection.tsx": "Manages unlockable premium content (director's cuts, behind-the-scenes, early access) that users can unlock through various criteria like badges, streaks, challenges, or token staking. Displays content cards with rarity levels, progress tracking, and estimated values for each unlockable item.",
  "frontend/src/components/UploadMovieForm.tsx": "Provides a form for uploading movies with title, description, poster image, and trailer video fields. Handles file uploads with progress tracking, integrates with backend mutations (useAddMovie, useUploadMovieContent), and displays upload progress with toast notifications.",
  "frontend/src/components/UserGeneratedPlaylistsSection.tsx": "Enables users to create, discover, and manage custom playlists for movies, music, or mixed content with social features like following, likes, and public/private visibility. Includes search, filtering, tabs for discovery vs. personal playlists, and displays playlist metadata including creator info, item counts, and tags.",
  "frontend/src/components/UserProfile.tsx": "Displays user profile page with tabs for favorites, watch history, and settings. Includes quick access cards for audience rewards, AI personalization, and engagement metrics, plus data usage and bandwidth settings panels.",
  "frontend/src/components/VideoQualitySelector.tsx": "Provides a popover UI for selecting video quality (240p-1080p) with auto/manual modes, displays connection info and bandwidth, and includes a low bandwidth mode toggle.",
  "frontend/src/components/VideoReviewsSection.tsx": "Displays a grid of video reviews with thumbnails, user avatars, ratings, and interaction buttons (like, comment, share) for community-generated movie reviews.",
  "frontend/src/components/VirtualFilmFestival.tsx": "Shows virtual film festival events with tabs for upcoming/live/past events, including premieres, Q&A sessions, and documentaries with RSVP and join functionality.",
  "frontend/src/components/VoiceSearchInterface.tsx": "Implements voice search UI with microphone button, transcript display, and mock voice recognition that returns search results for movies, music, and sports content.",
  "frontend/src/components/WatchPartyView.tsx": "Main watch party component that displays a video player with synchronized playback controls, live chat, reaction system with emojis, and participant list. Integrates with backend queries for watch party and movie data, and manages video state including play/pause, muting, and real-time reactions.",
  "frontend/src/components/WatchPartyViewWrapper.tsx": "Router wrapper component that extracts partyId from URL params and passes it to WatchPartyView with navigation handlers.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdaptiveStreaming.ts": "Hook for adaptive video quality management that automatically adjusts streaming quality based on bandwidth monitoring and low-bandwidth mode, with manual override options and buffer health tracking.",
  "frontend/src/hooks/useBackendHealthStatus.ts": "React Query hook that periodically checks backend health by calling a lightweight actor method, returning health status (Healthy/Degraded/Offline) with error details.",
  "frontend/src/hooks/useBandwidthMonitor.ts": "Hook that monitors network connection quality using the Network Information API, detecting connection type (2g/3g/4g/wifi) and recommending appropriate video quality levels based on downlink speed and RTT.",
  "frontend/src/hooks/useBandwidthSettings.ts": "Hook for managing user bandwidth preferences stored in localStorage, including default quality settings for WiFi/cellular, autoplay preferences, and data saver mode.",
  "frontend/src/hooks/useConnectionSpeedTest.ts": "Hook that performs network speed tests by measuring download/upload speeds and latency through timed fetch requests, returning results in Mbps and milliseconds.",
  "frontend/src/hooks/useDataUsageTracker.ts": "Hook that tracks video streaming data usage by quality level and duration, maintaining daily/weekly/monthly statistics in localStorage with automatic period resets and session history.",
  "frontend/src/hooks/useInstallPrompt.ts": "Hook for managing PWA installation prompts, detecting installability, handling beforeinstallprompt events, tracking install/dismiss state in localStorage, and providing iOS-specific detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLowBandwidthMode.ts": "React hook for managing low bandwidth mode state and quality override settings, persisting preferences to localStorage.",
  "frontend/src/hooks/useOfflineStatus.ts": "React hook that monitors online/offline status, checks for cached content availability, and tracks the last online timestamp.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including admin checks, movie/music/sports content management, user profiles, ratings, creator submissions, revenue sharing, and mock upload functionality.",
  "frontend/src/hooks/useRecentRuntimeErrors.ts": "React hook that captures and stores the most recent runtime errors and unhandled promise rejections (up to 20) with timestamps and stack traces.",
  "frontend/src/hooks/useServiceWorkerDiagnostics.ts": "React hook providing service worker diagnostics, update checking, cache clearing, and registration management with detailed status information.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark theme variables, mobile-optimized base styles, brand shadow utilities, animation keyframes, and responsive text/touch-target utilities.",
  "frontend/src/lib/imageOptimization.ts": "Provides image optimization utilities including responsive srcset generation with WebP conversion, lazy loading helpers, image preloading for LCP optimization, and client-side WebP conversion for user uploads.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/sw/registerServiceWorker.ts": "Handles service worker registration with automatic update checking, version management, cache clearing utilities, and controller change detection for mobile support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme colors (HSL-based design system), container settings, border radius variables, brand shadows, and animation keyframes for accordion and wave effects.",
  "project_state.json": "Project state tracking mobile compatibility issues as known problems, with existing features focused on fixing mobile responsiveness, touch events, viewport configuration, JavaScript errors, and service worker functionality.",
  "unknown.txt": "Deployment checklist and rollback plan template covering verification steps, post-deployment monitoring, support contacts, and production URLs for TamriStream."
}